app/controllers/api/agents_controller.rb

SELECT "agents".* FROM "agents"
---
  def index
    agents = Agent.all

INSERT INTO "messages" ("session_id", "role", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id", "created_at", "updated_at"
SELECT "messages".* FROM "messages" WHERE "messages"."session_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2  [["session_id", "5b257f14-3942-41b5-9e9e-ab721f900d2b"], ["LIMIT", 10]]
SELECT 1 AS one FROM "memories" WHERE "memories"."agent_id" = $1 LIMIT $2  [["agent_id", "7cee9f41-bdae-4c73-8023-5be6e501e69f"], ["LIMIT", 1]]
---
  def chat
    message_content = params.require(:message)
    channel = params[:channel] || 'web'

    # Usar sesión activa o crear nueva
    session = current_agent.sessions.where(channel: channel, ended_at: nil).order(created_at: :desc).first
    session ||= current_agent.sessions.create!(channel: channel, started_at: Time.current)

    # Guardar mensaje del usuario
    user_message = session.messages.create!(role: 'user', content: message_content)

    # Obtener historial de mensajes para contexto
    history = session.messages.order(created_at: :asc).last(10).map do |m|
      { role: m.role, content: m.content }
    end

    # Buscar memorias relevantes (si Ollama está disponible)
    context_memories = ""
    if OllamaService.available?
      relevant_memories = OllamaService.similar_memories(current_agent.id, message_content, 3)
      if relevant_memories.any?

INSERT INTO "messages" ("session_id", "role", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id", "created_at", "updated_at"
---
    response_content = response[:content]

    # Guardar respuesta del asistente
    assistant_message = session.messages.create!(role: 'assistant', content: response_content)