app/controllers/api/tools_controller.rb

  def index
    tools = Tool.all
---
SELECT "tools".* FROM "tools"