app/controllers/api/tool_executions_controller.rb

  def approve
    execution = ToolExecution.find(params[:id])

    unless execution.requires_approval?
      render json: { error: 'Execution already processed' }, status: :unprocessable_entity
      return
    end

    execution.update!(
      approved_by: current_agent.id,
      status: 'approved'
    )
---
SELECT "tool_executions".* FROM "tool_executions" WHERE "tool_executions"."id" = $1 LIMIT $2  [["id", "261effe8-6677-4ab2-b3ea-9955a9cd1823"], ["LIMIT", 1]]
UPDATE "tool_executions" SET "approved_by" = $1, "status" = $2, "updated_at" = $3 WHERE "tool_executions"."id" = $4  [["approved_by", "7cee9f41-bdae-4c73-8023-5be6e501e69f"], ["status", "approved"], ["updated_at", "2026-02-25 18:50:17.515307"], ["id", "261effe8-6677-4ab2-b3ea-9955a9cd1823"]]

  def reject
    execution = ToolExecution.find(params[:id])

    execution.update!(
      approved_by: current_agent.id,
      status: 'rejected'
    )
---
SELECT "tool_executions".* FROM "tool_executions" WHERE "tool_executions"."id" = $1 LIMIT $2  [["id", "b0301cf8-c86b-4cac-837d-c0a350926a9d"], ["LIMIT", 1]]
UPDATE "tool_executions" SET "approved_by" = $1, "status" = $2, "updated_at" = $3 WHERE "tool_executions"."id" = $4  [["approved_by", "7cee9f41-bdae-4c73-8023-5be6e501e69f"], ["status", "rejected"], ["updated_at", "2026-02-25 18:50:56.236490"], ["id", "b0301cf8-c86b-4cac-837d-c0a350926a9d"]]