app/views/conversations/index.html.erb

SELECT COUNT(*) FROM "messages" WHERE "messages"."session_id" = $1  [["session_id", "5b257f14-3942-41b5-9e9e-ab721f900d2b"]]
---
          </td>
          <td><%= session.messages.count %></td>