app/controllers/agents_controller.rb

  def index
    @agents = Agent.all
---
SELECT "agents".* FROM "agents"

  def set_agent
    @agent = Agent.find(params[:id])
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = $1 LIMIT $2  [["id", "7cee9f41-bdae-4c73-8023-5be6e501e69f"], ["LIMIT", 1]]