app/controllers/application_controller.rb

SELECT "agents".* FROM "agents" ORDER BY "agents"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def current_agent
    @current_agent ||= Agent.find_by(id: session[:agent_id]) if session[:agent_id]
    @current_agent ||= Agent.find_by(id: request.headers['X-Agent-Id']) if request.headers['X-Agent-Id']
    @current_agent ||= Agent.first if request.path.start_with?('/api')