app/controllers/chat_controller.rb

  def set_agent
    # Por defecto, usar el agente Spot
    @agent = Agent.find_by(name: 'Spot') || Agent.first
---
SELECT "agents".* FROM "agents" WHERE "agents"."name" = $1 LIMIT $2  [["name", "Spot"], ["LIMIT", 1]]