app/controllers/dashboard_controller.rb

  def index
    @agents = Agent.all
    @sessions_today = Session.where("created_at >= ?", Date.today).count
    @memories_count = Memory.count
    @pending_executions = ToolExecution.where(status: 'pending').count
---
SELECT "agents".* FROM "agents"
SELECT COUNT(*) FROM "memories"
SELECT COUNT(*) FROM "tool_executions" WHERE "tool_executions"."status" = $1  [["status", "pending"]]