app/controllers/executions_controller.rb

SELECT "tool_executions".* FROM "tool_executions" ORDER BY "tool_executions"."created_at" DESC LIMIT $1  [["LIMIT", 50]]
---
  def index
    @executions = ToolExecution.order(created_at: :desc).limit(50)