app/controllers/memories_controller.rb

SELECT "memories".* FROM "memories" ORDER BY "memories"."created_at" DESC LIMIT $1  [["LIMIT", 100]]
---
  def index
    @memories = Memory.order(created_at: :desc).limit(100)