app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

SELECT "tools".* FROM "tools" WHERE "tools"."id" = $1 LIMIT $2  [["id", "a524162a-3e57-4558-aaf4-d28755e47ecd"], ["LIMIT", 1]]
---
  def set_tool
    @tool = Tool.find(params[:id])